# Regression Project

The main goal of the project: pick a regression model and find the best
RMSE given train data (X and y) and given the X of the test data. The y of the test data is not given.

In [76]:
# Imports:
import pandas as pd
import seaborn as sns # Correlation matrix

In [24]:
X_train = pd.read_csv("X.csv")
X_train.head(4)

,Unnamed: 0,Unnamed: 0.1,Age,Gender,Education Level,Job Title,Years of Experience,Country,Race,height,weight,id,professionalism
0,2477,2477,52.0,M,bachelor's|degr,back|end|develope,24.0,australi,Asian,1.800316,95.021957,2477,1150.0
1,76,76,52.0,F,bachelor,operations|manage,23.0,us,White,2.451414,87.456039,76,1100.0
2,64,64,27.0,M,bachelor,junior|accountan,2.0,australi,Australian,1.917509,56.997108,64,26.0
3,924,924,32.0,M,bachelor,data|analys,11.0,u,Welsh,2.160562,61.403169,924,279.0

In [25]:
X_train.shape

(5363, 13)

Check if the columns are duplicates

In [26]:
X_train.columns

Index(['Unnamed: 0', 'Unnamed: 0.1', 'Age', 'Gender', 'Education Level',
       'Job Title', 'Years of Experience', 'Country', 'Race', 'height',
       'weight', 'id', 'professionalism'],
      dtype='object')

In [27]:
# Check if 'Unnamed: 0', 'Unnamed: 0.1' and 'id' are duplicates
are_columns_duplicates_1_2 = (X_train['Unnamed: 0'] == X_train['Unnamed: 0.1']).all()
are_columns_duplicates_1_id = (X_train['Unnamed: 0'] == X_train['id']).all()
are_columns_duplicates_2_id = (X_train['Unnamed: 0.1'] == X_train['id']).all()

# Drop 'Unnamed: 0' and 'Unnamed: 0.1' if they are duplicates of 'id'
if are_columns_duplicates_1_2 and are_columns_duplicates_1_id and are_columns_duplicates_2_id:
    X_train.drop(['Unnamed: 0', 'Unnamed: 0.1'], axis=1, inplace=True)

In [28]:
X_train.head(4)

,Age,Gender,Education Level,Job Title,Years of Experience,Country,Race,height,weight,id,professionalism
0,52.0,M,bachelor's|degr,back|end|develope,24.0,australi,Asian,1.800316,95.021957,2477,1150.0
1,52.0,F,bachelor,operations|manage,23.0,us,White,2.451414,87.456039,76,1100.0
2,27.0,M,bachelor,junior|accountan,2.0,australi,Australian,1.917509,56.997108,64,26.0
3,32.0,M,bachelor,data|analys,11.0,u,Welsh,2.160562,61.403169,924,279.0

In [29]:
X_train.shape  # changed from (5363, 13) to (5363, 11)

(5363, 11)

In [37]:
# Get the info of each column
X_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5363 entries, 0 to 5362
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  5359 non-null   float64
 1   Gender               5359 non-null   object
 2   Education Level      5360 non-null   object
 3   Job Title            5361 non-null   object
 4   Years of Experience  5360 non-null   float64
 5   Country              5363 non-null   object
 6   Race                 5363 non-null   object
 7   height               5363 non-null   float64
 8   weight               5361 non-null   float64
 9   id                   5363 non-null   int64
 10  professionalism      5360 non-null   float64
dtypes: float64(5), int64(1), object(5)
memory usage: 461.0+ KB

In [38]:
# Find rows where any cell has a null value
rows_with_null = X_train[X_train.isna().any(axis=1)]

print(rows_with_null)

       Age Gender  Education Level         Job Title  Years of Experience  \
417    NaN    NaN         bachelor  software|enginee                120.0
467   28.0      M              NaN          develope                  9.0
1309   NaN    NaN              NaN               NaN                  NaN
2839   NaN    NaN           master       data|analys                120.0
3071  28.0      F  bachelor's|degr           social|                  NaN
4110   NaN    NaN              NaN               NaN                  NaN

                Country             Race    height      weight    id  \
417   RazShmuelykingdom  NayaCollegegeek  2.492683  200.000000     0
467                   u            White  2.481139   29.526878  2011
1309                  u            White  2.497256         NaN   172
2839  RazShmuelykingdom  NayaCollegegeek  2.480525  200.000000     1
3071                 us            White  1.510105   50.294254  5247
4110              canad            White  1.675847         NaN   260

      professionalism
417             160.0
467             189.0
1309              NaN
2839             84.0
3071              NaN
4110              NaN

In [39]:
# Remove all rows with any missing values (as they are only 6 rows out of 5363 rows):
X_train.dropna(inplace=True)

In [41]:
X_train.shape  # changed from (5363, 13) to (5357, 11)

(5357, 11)

In [52]:
y_train = pd.read_csv("y.csv")
y_train.head(4)
# print(y_train.shape)  # (5363, 2)

     id    Salary
0  2477  175966.0
1    76  160000.0
2    64   35000.0
3   924  195000.0

In [54]:
y_train.info()  # we have all ids, but 5 of them have null Salary value

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5363 entries, 0 to 5362
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      5363 non-null   int64
 1   Salary  5358 non-null   float64
dtypes: float64(1), int64(1)
memory usage: 83.9 KB

In [55]:
rows_with_null_y = y_train[y_train.isna().any(axis=1)]
print(rows_with_null_y)

        id  Salary
1138  3136     NaN
1309   172     NaN
3071  5247     NaN
4110   260     NaN
5077  6455     NaN

In [57]:
# Remove 5 rows with missing salary value:
y_train.dropna(inplace=True)

In [58]:
# Filter the data frames to only include 'id' values that are present in both:
common_ids = set(X_train['id']) & set(y_train['id'])

X_train = X_train[X_train['id'].isin(common_ids)]
y_train = y_train[y_train['id'].isin(common_ids)] 

print(X_train.shape, y_train.shape)

(5355, 11) (5355, 2)

In [62]:
X_test = pd.read_csv("X_test.csv")
print(X_test.shape)
X_test.head(3)

(1341, 13)

,Unnamed: 0,Unnamed: 0.1,Age,Gender,Education Level,Job Title,Years of Experience,Country,Race,height,weight,id,professionalism
0,6480,6480,47.0,M,master's|degr,director|of|marketin,16.0,us,Hispanic,1.818297,88.182651,6480,675.0
1,5343,5343,29.0,F,bachelor's|degr,social|media|manage,4.0,us,African American,1.562833,59.760856,5343,81.0
2,2576,2576,29.0,M,high|scho,back|end|develope,5.0,us,African American,2.059395,46.765234,2576,108.0

In [63]:
# Check if 'Unnamed: 0', 'Unnamed: 0.1' and 'id' are duplicates
are_columns_duplicates_1_2 = (X_test['Unnamed: 0'] == X_test['Unnamed: 0.1']).all()
are_columns_duplicates_1_id = (X_test['Unnamed: 0'] == X_test['id']).all()
are_columns_duplicates_2_id = (X_test['Unnamed: 0.1'] == X_test['id']).all()

# Drop 'Unnamed: 0' and 'Unnamed: 0.1' if they are duplicates of 'id'
if are_columns_duplicates_1_2 and are_columns_duplicates_1_id and are_columns_duplicates_2_id:
    X_test.drop(['Unnamed: 0', 'Unnamed: 0.1'], axis=1, inplace=True)

In [64]:
X_test.shape  # changed from (1341, 13) to (1341, 11)
X_test.info() # X test has no missing data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1341 entries, 0 to 1340
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  1341 non-null   float64
 1   Gender               1341 non-null   object
 2   Education Level      1341 non-null   object
 3   Job Title            1341 non-null   object
 4   Years of Experience  1341 non-null   float64
 5   Country              1341 non-null   object
 6   Race                 1341 non-null   object
 7   height               1341 non-null   float64
 8   weight               1341 non-null   float64
 9   id                   1341 non-null   int64
 10  professionalism      1341 non-null   float64
dtypes: float64(5), int64(1), object(5)
memory usage: 115.4+ KB

In [70]:
# set(X_train['Gender'])
# set(X_train['Education Level'])
# set(X_train['Job Title'])
# set(X_train['Country'])
# set(X_train['Race'])

In [74]:
# Columns of interest
object_columns = ['Gender', 'Education Level', 'Job Title', 'Country', 'Race']

# Loop through and print unique values
for column in object_columns:
    unique_values = set(X_train[column])
    print(f"Unique values in {column}:")
    print(", ".join([str(x) for x in unique_values]))
    print('-' * 50)

Unique values in Gender:
F, M, O
--------------------------------------------------
Unique values in Education Level:
high|scho, p, bachelor's|degr, bachelor, master, master's|degr
--------------------------------------------------
Unique values in Job Title:
juniour|hr|coordinato, sales|manage, product|manage, senior|scientis, senior|it|project|manage, senior|project|manage, strategy|consultan, junior|designe, senior|project|enginee, training|specialis, digital|marketing|specialis, office|manage, junior|business|development|associat, receptionis, technical|recruite, senior|human|resources|specialis, senior|software|develope, junior|web|designe, social|media|ma, senior|software|enginee, junior|marketing|coordinato, business|intelligence|analys, senior|project|coordinato, accountan, marketing|coordinato, copywrite, event|coordinato, director|of|sales|and|marketin, junior|web|develope, junior|account|manage, ux|researche, junior|social|media|specialis, director|of|data|scienc, director|of|human|capita, marketing|specialis, financial|analys, digital|content|produce, financial|adviso, junior|financial|analys, junior|copywrite, director|of|engineerin, principal|scientis, customer|success|re, senior|marketing|manage, senior|operations|coordinato, business|analys, senior|product|marketing|manage, junior|operations|analys, sales|associat, senior|sales|representativ, junior|marketing|analys, software|manage, junior|develope, web|develope, senior|training|specialis, software|develope, senior|business|development|manage, technical|support|specialis, junior|research|scientis, senior|hr|specialis, customer|success|manage, social|media|specialis, senior|manage, senior|sales|manage, junior|accountan, senior|enginee, senior|operations|analys, director|of|marketin, junior|hr|coordinato, marketing|directo, marketing|analys, senior|financial|analys, sales|representativ, full|stack|enginee, content|marketing|manage, senior|business|analys, operations|directo, junior|product|manage, senior|financial|manage, junior|sales|representativ, junior|social|media|manage, vp|of|financ, administrative|assistan, data|entry|cler, help|desk|analys, senior|it|consultan, front|end|develope, operations|manage, junior|ux|designe, recruite, junior|data|analys, senior|human|resources|manage, senior|marketing|directo, vp|of|operation, junior|recruite, operations|analys, it|support|specialis, director|of|human|resource, it|manage, director|of|sale, business|development|manage, junior|customer|support|specialis, junior|marketing|manage, junior|financial|adviso, software|project|manage, director|of|operation, research|scientis, public|relations|manage, ce, junior|business|analys, product|marketing|manage, hr|generalis, senior|human|resources|coordinato, junior|hr|generalis, human|resources|coordinato, director|of|financ, senior|financial|adviso, senior|data|enginee, senior|data|analys, back|end|develope, junior|data|scientis, project|manage, financial|manage, senior|marketing|specialis, human|resources|directo, sales|directo, customer|service|re, data|scientis, network|enginee, junior|business|operations|analys, senior|data|scientis, junior|project|manage, marketing|manage, senior|product|designe, directo, senior|it|support|specialis, senior|product|development|manage, software|enginee, software|engineer|manage, senior|marketing|analys, senior|hr|generalis, creative|directo, product|designe, chief|technology|office, juniour|hr|generalis, senior|graphic|designe, data|analys, ux|designe, senior|product|manage, junior|software|enginee, supply|chain|manage, senior|operations|manage, social|media|manage, senior|hr|manage, research|directo, account|manage, junior|sales|associat, sales|executiv, customer|service|representativ, junior|marketing|specialis, customer|service|manage, senior|marketing|coordinato, digital|marketing|manage, human|resources|manage, junior|software|develope, director|of|h, delivery|drive, senior|research|scientis, graphic|designe, technical|write, hr|manage, junior|operations|manage, senior|accountan
--------------------------------------------------
Unique values in Country:
chin, canad, us, australi, u
--------------------------------------------------
Unique values in Race:
Mixed, African American, Hispanic, Asian, White, Australian, Black, Korean, Welsh, Chinese
--------------------------------------------------

In [72]:
# Consider dropping those rows
rows_with_O = X_train[X_train['Gender'] == 'O']
print(len(rows_with_O))

12

In [75]:
# X_train.describe()

,Age,Years of Experience,height,weight,id,professionalism
count,5355.000000,5355.000000,5355.000000,5355.000000,5355.000000,5355.000000
mean,35.151634,9.620448,2.002327,66.899744,3364.586368,316.499627
std,7.616544,6.077945,0.292174,18.166318,1932.868068,305.097897
min,22.000000,1.000000,1.500276,13.637206,4.000000,0.000000
25%,29.000000,5.000000,1.750666,53.893328,1694.500000,84.000000
50%,33.000000,8.000000,2.000633,64.747191,3366.000000,217.000000
75%,39.000000,13.000000,2.261611,78.370881,5044.500000,451.000000
max,64.000000,36.000000,2.499932,139.997724,6703.000000,2040.000000

In [78]:
#